Dlubal.DynamPro.ItemAt
Define type of accessing an object.

Dlubal.DynamPro.ItemAt.AtIndex
Object is get by index of array where is the object placed.

Dlubal.DynamPro.ItemAt.AtNo
Object is get by object number.